Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: يا أيها الذين آمنوا ليستأذنكم الذين ملكت أيمانكم والذين لم يبلغوا الحلم منكم ثلاث مرات من قبل صلاة الفجر وحين تضعون ثيابكم من الظهيرة ومن بعد صلاة العشاء ثلاث عورات لكم ليس عليكم ولا عليهم جناح بعدهن طوافون عليكم بعضكم على بعض كذلك يبين الله لكم الآيات والله عليم حكيم
en: O you who believe! Let your slaves and slave-girls, and those among you who have not come to the age of puberty ask your permission (before they come to your presence) on three occasions: before Fajr (morning) Salat (prayer), and while you put off your clothes for the noonday (rest), and after the 'Isha' (late-night) Salat (prayer). (These) three times are of privacy for you; other than these times there is no sin on you or on them to move about, attending to each other. Thus Allah makes clear the Ayat (the Verses of this Qur'an, showing proofs for the legal aspects of permission for visits) to you. And Allah is All-Knowing, All-Wise.

source: وإذا بلغ الأطفال منكم الحلم فليستأذنوا كما استأذن الذين من قبلهم كذلك يبين الله لكم آياته والله عليم حكيم
en: And when the children among you come to puberty, then let them (also) ask for permission, as those senior to them (in age). Thus Allah makes clear His Ayat (Commandments and legal obligations) for you. And Allah is All-Knowing, All-Wise.

source: والقواعد من النساء اللاتي لا يرجون نكاحا فليس عليهن جناح أن يضعن ثيابهن غير متبرجات بزينة وأن يستعففن خير لهن والله سميع عليم
en: And as for women past child-bearing who do not expect wed-lock, it is no sin on them if they discard their (outer) clothing in such a way as not to show their adornment. But to refrain (i.e. not to discard their outer clothing) is better for them. And Allah is All-Hearer, All-Knower.

source: ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ولا على أنفسكم أن تأكلوا من بيوتكم أو بيوت آبائكم أو بيوت أمهاتكم أو بيوت إخوانكم أو بيوت أخواتكم أو بيوت أعمامكم أو بيوت عماتكم أو بيوت أخوالكم أو بيوت خالاتكم أو ما ملكتم مفاتحه أو صديقكم ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا فإذا دخلتم بيوتا فسلموا على أنفسكم تحية من عند الله مباركة طيبة كذلك يبين الله لكم الآيات لعلكم تعقلون
en: There is no restriction on the blind, nor any restriction on the lame, nor any restriction on the sick, nor on yourselves, if you eat from your houses, or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters, or the houses of your father's brothers, or the houses of your father's sisters, or the houses of your mother's brothers, or the houses of your mother's sisters, or (from that) whereof you hold keys, or (from the house) of a friend. No sin on you whether you eat together or apart. But when you enter the houses, greet one another with a greeting from Allah (i.e. say: السلام عليكم) As-Salamu 'Alaikum - peace be on you) blessed and good. Thus Allah makes clear the Ayat (these Verses or your religious symbols and signs) to you that you may understand.

source: إنما المؤمنون الذين آمنوا بالله ورسوله وإذا كانوا معه على أمر جامع لم يذهبوا حتى يستأذنوه إن الذين يستأذنونك أولئك الذين يؤمنون بالله ورسوله فإذا استأذنوك لبعض شأنهم فأذن لمن شئت منهم واستغفر لهم الله إن الله غفور رحيم
en: The true believers are only those, who believe in (the Oneness of) Allah and His Messenger (Muhammad صلى الله عليه وسلم): and when they are with him on some common matter, they go not away until they have asked his permission. Verily those who ask your permission, those are they who (really) believe in Allah and His Messenger. So if they ask your permission for some affairs of theirs, give permission to whom you will of them, and ask Allah for their forgiveness. Truly, Allah is Oft-Forgiving, Most Merciful.

source: لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا قد يعلم الله الذين يتسللون منكم لواذا فليحذر الذين يخالفون عن أمره أن تصيبهم فتنة أو يصيبهم عذاب أليم
en: Make not the calling of the Messenger (Muhammad صلى الله عليه وسلم) among you as your calling one of another. Allah knows those of you who slip away under shelter (of some excuse without taking the permission to leave, from the Messenger (صلى الله عليه وسلم). And let those who oppose the Messenger's (Muhammad صلى الله عليه وسلم) commandment (i.e. his Sunnah - legal ways, orders, acts of worship, statements) (among the sects) beware, lest some Fitnah (disbelief, trials, afflictions, earthquakes, killing, overpowered by a tyrant) should befall them or a painful torment be inflicted on them.

source: ألا إن لله ما في السماوات والأرض قد يعلم ما أنتم عليه ويوم يرجعون إليه فينبئهم بما عملوا والله بكل شيء عليم
en: Certainly, to Allah belongs all that is in the heavens and the earth. Surely, He knows your condition and (He knows) the Day when they will be brought back to Him, then He will inform them of what they did. And Allah is All-Knower of everything.

source: تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا
en: Blessed be He Who sent down the criterion (of right and wrong, i.e. this Qur'an) to His slave (Muhammad صلى الله عليه وسلم) that he may be a warner to the 'Alamin (mankind and jinn).

source: الذي له ملك السماوات والأرض ولم يتخذ ولدا ولم يكن له شريك في الملك وخلق كل شيء فقدره تقديرا
en: He to Whom belongs the dominion of the heavens and the earth, and Who has begotten no son (children or offspring) and for Whom there is no partner in the dominion. He has created everything, and has measured it exactly according to its due measurements.

source: واتخذوا من دونه آلهة لا يخلقون شيئا وهم يخلقون ولا يملكون لأنفسهم ضرا ولا نفعا ولا يملكون موتا ولا حياة ولا نشورا
en: Yet they have taken besides Him other alihah (gods) who created nothing but are themselves created, and possess neither harm nor benefit for themselves, and possess no power (of causing) death, nor (of giving) life, nor of raising the dead.

source: وقال الذين كفروا إن هذا إلا إفك افتراه وأعانه عليه قوم آخرون فقد جاءوا ظلما وزورا
en: Those who disbelieve say: "This (the Qur'an) is nothing but a lie that he (Muhammad صلى الله عليه وسلم) has invented, and others have helped him at it. In fact they have produced an unjust wrong (thing) and a lie."

source: وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا
en: And they say: "Tales of the ancients, which he has written down: and they are dictated to him morning and afternoon."

source: قل أنزله الذي يعلم السر في السماوات والأرض إنه كان غفورا رحيما
en: Say: "It (this Qur'an) has been sent down by Him (Allah) (the Real Lord of the heavens and earth) Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful."

source: وقالوا مال هذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا
en: And they say: "Why does this Messenger (Muhammad صلى الله عليه وسلم) eat food, and walk about in the markets (as we). Why is not an angel sent down to him to be a warner with him?

source: أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا
en: "Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat?" And the Zalimun (polytheists and wrong-doers) say: "You follow none but a man bewitched."

source: تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا
en: Blessed be He Who, if He wills will assign you better than (all) that - Gardens under which rivers flow (Paradise) and will assign you palaces (i.e. in Paradise).

source: بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا
en: Nay, they deny the Hour (the Day of Resurrection), and for those who deny the Hour, We have prepared a flaming Fire (i.e. Hell).

source: إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا
en: When it (Hell) sees them from a far place, they will hear its raging and its roaring.

source: وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا
en: And when they shall be thrown into a narrow place thereof, chained together, they will exclaim therein for destruction.

source: لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا
en: Exclaim not today for one destruction, but exclaim for many destructions.

source: قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهم جزاء ومصيرا
en: Say: (O Muhammad صلى الله عليه وسلم) "Is that (torment) better or the Paradise of Ete - nity which is promised to the Muttaqun (the pious - See V.2:2)?" It will be theirs as a reward and as a final destination.

source: لهم فيها ما يشاءون خالدين كان على ربك وعدا مسئولا
en: For them there will be therein all that they desire, and they will abide (there forever). It is a promise binding upon your Lord that must be fulfilled.

source: ويوم يحشرهم وما يعبدون من دون الله فيقول أأنتم أضللتم عبادي هؤلاء أم هم ضلوا السبيل
en: And on the Day when He will gather them together and that which they worship besides Allah [idols, angels, pious men, saints] . He will say: "Was it you who misled these My slaves or did they (themselves) stray from the (Right) Path?"

source: قالوا سبحانك ما كان ينبغي لنا أن نتخذ من دونك من أولياء ولكن متعتهم وآباءهم حتى نسوا الذكر وكانوا قوما بورا
en: They will say: "Glorified be You! It was not for us to take any Auliya' (Protectors, Helpers) besides You, but You gave them and their fathers comfort till they forgot the warning, and became a lost people (doomed to total loss).

source: فقد كذبوكم بما تقولون فما تستطيعون صرفا ولا نصرا ومن يظلم منكم نذقه عذابا كبيرا
en: Thus they (false gods - all deities other than Allah) will belie you (polytheists) regarding what you say (that they are gods besides Allah): then you can neither avert (the punishment), nor get help. And whoever among you does wrong (i.e. sets up rivals to Allah), We shall make him taste a great torment.

source: وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق وجعلنا بعضكم لبعض فتنة أتصبرون وكان ربك بصيرا
en: And We never sent before you (O Muhammad صلى الله عليه وسلم) any of the Messengers but verily, they ate food and walked in the markets. And We have made some of you as a trial for others: will you have patience? And your Lord is Ever All-Seer (of everything).

source: وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا
en: And those who expect not a Meeting with Us (i.e. those who deny the Day of Resurrection and the life of the Hereafter) said: "Why are not the angels sent down to us, or why do we not see our Lord?" Indeed they think too highly of themselves, and are scornful with great pride.

source: يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا
en: On the Day they will see the angels - no glad tidings will there be for the Mujrimun (criminals, disbelievers, polytheists, sinners) that day. And they (angels) will say: "All kinds of glad tidings are forbidden to you," [none will be allowed to enter Paradise except the one who said: La ilaha illallah, "(none has the right to be worshipped but Allah) and acted practically on its legal orders and obligations. See the footnote of V.2:193)].

source: وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا
en: And We shall turn to whatever deeds they (disbelievers, polytheists, sinners) did, and We shall make such deeds as scattered floating particles of dust.

source: أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا
en: The dwellers of Paradise (i.e. those who deserved it through their Islamic Monotheistic Faith and their deeds of righteousness) will, on that Day, have the best abode, and have the fairest of places for repose.

source: ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا
en: And (remember) the Day when the heaven shall be rent asunder with clouds, and the angels will be sent down, with a grand descending.

source: الملك يومئذ الحق للرحمن وكان يوما على الكافرين عسيرا
en: The sovereignty on that Day will be the true (sovereignty), belonging to the Most Gracious (Allah), and it will be a hard Day for the disbelievers (those who disbelieve in the Oneness of Allah - Islamic Monotheism).

source: ويوم يعض الظالم على يديه يقول يا ليتني اتخذت مع الرسول سبيلا
en: And (remember) the Day when the Zalim (wrong-doer, oppressor, polytheist) will bite at his hands, he will say: "Oh! Would that I had taken a path with the Messenger (Muhammad صلى الله عليه وسلم).

source: يا ويلتى ليتني لم أتخذ فلانا خليلا
en: "Ah! Woe to me! Would that I had never taken so-and-so as a Khalil (an intimate friend)!

source: لقد أضلني عن الذكر بعد إذ جاءني وكان الشيطان للإنسان خذولا
en: "He indeed led me astray from the Reminder (this Qur'an) after it had come to me. And Shaitan (Satan) is to man ever a deserter in the hour of need." [Tafsir Al-Qurtubi]

source: وقال الرسول يا رب إن قومي اتخذوا هذا القرآن مهجورا
en: And the Messenger (Muhammad صلى الله عليه وسلم) will say: "O my Lord! Verily, my people deserted this Qur'an (neither listened to it, nor acted on its laws and teachings).

source: وكذلك جعلنا لكل نبي عدوا من المجرمين وكفى بربك هاديا ونصيرا
en: Thus have We made for every Prophet an enemy among the Mujrimun (disbelievers, polytheists, criminals). But Sufficient is your Lord as a Guide and Helper.

source: وقال الذين كفروا لولا نزل عليه القرآن جملة واحدة كذلك لنثبت به فؤادك ورتلناه ترتيلا
en: And those who disbelieve say: "Why is not the Qur'an revealed to him all at once?" Thus (it is sent down in parts), that We may strengthen your heart thereby. And We have revealed it to you gradually, in stages. (It was revealed to the Prophet صلى الله عليه وسلم in 23 years.).

source: ولا يأتونك بمثل إلا جئناك بالحق وأحسن تفسيرا
en: And no example or similitude do they bring (to oppose or to find fault in you or in this Qur'an), but We reveal to you the truth (against that similitude or example), and the better explanation thereof.

source: الذين يحشرون على وجوههم إلى جهنم أولئك شر مكانا وأضل سبيلا
en: Those who will be gathered to Hell (prone) on their faces, such will be in an evil state, and most astray from the (Straight) Path.

source: ولقد آتينا موسى الكتاب وجعلنا معه أخاه هارون وزيرا
en: And indeed We gave Musa (Moses) the Scripture [the Taurat (Torah)], and placed his brother Harun (Aaron) with him as a helper;

source: فقلنا اذهبا إلى القوم الذين كذبوا بآياتنا فدمرناهم تدميرا
en: And We said: "Go you both to the people who have denied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.)." Then We destroyed them with utter destruction.

source: وقوم نوح لما كذبوا الرسل أغرقناهم وجعلناهم للناس آية وأعتدنا للظالمين عذابا أليما
en: And Nuh's (Noah) people, when they denied the Messengers, We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the Zalimun (polytheists and wrong-doers).

source: وعادا وثمود وأصحاب الرس وقرونا بين ذلك كثيرا
en: And (also) 'Ad and Thamud, and the Dwellers of Ar-Rass, and many generations in between.

source: وكلا ضربنا له الأمثال وكلا تبرنا تتبيرا
en: And for each (of them) We put forward examples (as proofs and lessons), and each (of them) We brought to utter ruin (because of their disbelief and evil deeds).

source: ولقد أتوا على القرية التي أمطرت مطر السوء أفلم يكونوا يرونها بل كانوا لا يرجون نشورا
en: And indeed they have passed by the town [of Prophet Lut (Lot)] on which was rained the evil rain. Did they (disbelievers) not then see it (with their own eyes)? Nay! But they used not to expect any resurrection.

source: وإذا رأوك إن يتخذونك إلا هزوا أهذا الذي بعث الله رسولا
en: And when they see you (O Muhammad صلى الله عليه وسلم), they treat you only in mockery (saying): "Is this the one whom Allah has sent as a Messenger?

source: إن كاد ليضلنا عن آلهتنا لولا أن صبرنا عليها وسوف يعلمون حين يرون العذاب من أضل سبيلا
en: "He would have nearly misled us from our alihah (gods), had it not been that we were patient and constant in their worship!" And they will know when they see the torment, who it is that is most astray from the (Right) Path!

source: أرأيت من اتخذ إلهه هواه أفأنت تكون عليه وكيلا
en: Have you (O Muhammad صلى الله عليه وسلم) seen him who has taken as his ilah (god) his own vain desire? Would you then be a Wakil (a disposer of his affairs or a watcher) over him?

source: أم تحسب أن أكثرهم يسمعون أو يعقلون إن هم إلا كالأنعام بل هم أضل سبيلا
en: Or do you think that most of them hear or understand? They are only like cattle - nay, they are even farther astray from the Path (i.e. even worse than cattle).

source: ألم تر إلى ربك كيف مد الظل ولو شاء لجعله ساكنا ثم جعلنا الشمس عليه دليلا
en: Have you not seen how your Lord spread the shadow. If He willed, He could have made it still - But We have made the sun its guide (i.e. after the sunrise, the shadow shrinks and vanishes at midnoon and then again appears in the afternoon with the decline of the sun, and had there been no sunlight, there would have been no shadow).

source: ثم قبضناه إلينا قبضا يسيرا
en: Then We withdraw it to Us a gradual concealed withdrawal.

source: وهو الذي جعل لكم الليل لباسا والنوم سباتا وجعل النهار نشورا
en: And it is He Who makes the night a covering for you, and the sleep (as) a repose, and makes the day Nushur (i.e. getting up and going about here and there for daily work, after one's sleep at night, or like resurrection after one's death).

source: وهو الذي أرسل الرياح بشرا بين يدي رحمته وأنزلنا من السماء ماء طهورا
en: And it is He Who sends the winds as heralds of glad tidings, going before His Mercy (rain); and We send down pure water from the sky.

source: لنحيي به بلدة ميتا ونسقيه مما خلقنا أنعاما وأناسي كثيرا
en: That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We had created.

source: ولقد صرفناه بينهم ليذكروا فأبى أكثر الناس إلا كفورا
en: And indeed We have distributed it (rain or water) amongst them in order that they may remember (the Grace of Allah,) but most men (refuse to accept the Truth or Faith and) accept nothing but disbelief or ingratitude.

source: ولو شئنا لبعثنا في كل قرية نذيرا
en: And had We willed, We would have raised a warner in every town.

source: فلا تطع الكافرين وجاهدهم به جهادا كبيرا
en: So obey not the disbelievers, but strive against them (by preaching) with the utmost endeavour with it (the Qur'an).

source: وهو الذي مرج البحرين هذا عذب فرات وهذا ملح أجاج وجعل بينهما برزخا وحجرا محجورا
en: And it is He Who has let free the two seas (kinds of water): this is palatable and sweet, and that is salt and bitter; and He has set a barrier and a complete partition between them.

source: وهو الذي خلق من الماء بشرا فجعله نسبا وصهرا وكان ربك قديرا
en: And it is He Who has created man from water, and has appointed for him kindred by blood, and kindred by marriage. And your Lord is Ever All-Powerful to do what He wills.

source: ويعبدون من دون الله ما لا ينفعهم ولا يضرهم وكان الكافر على ربه ظهيرا
en: And they (disbelievers, polytheists) worship besides Allah that which can neither profit them nor harm them; and the disbeliever is ever a helper (of the Satan) against his Lord.

source: وما أرسلناك إلا مبشرا ونذيرا
en: And We have sent you (O Muhammad صلى الله عليه وسلم) only as a bearer of glad tidings and a warner.

source: قل ما أسألكم عليه من أجر إلا من شاء أن يتخذ إلى ربه سبيلا
en: Say: "No reward do I ask of you for this (that which I have brought from my Lord and its preaching), save that whosoever wills may take a Path to his Lord.

source: وتوكل على الحي الذي لا يموت وسبح بحمده وكفى به بذنوب عباده خبيرا
en: And put your trust (O Muhammad صلى الله عليه وسلم) in the Ever Living One Who dies not, and glorify His Praises, and Sufficient is He as the All-Knower of the sins of His slaves,

source: الذي خلق السماوات والأرض وما بينهما في ستة أيام ثم استوى على العرش الرحمن فاسأل به خبيرا
en: Who created the heavens and the earth and all that is between them in six Days. Then He (Istawa ) rose over the Throne (in a manner that suits His Majesty). The Most Gracious (Allah)! Ask Him (O Prophet Muhammad صلى الله عليه وسلم , concerning His Qualities: His rising over His Throne, His creations, etc.), as He is Al-Khabir (The All-Knower of everything i.e. Allah).

source: وإذا قيل لهم اسجدوا للرحمن قالوا وما الرحمن أنسجد لما تأمرنا وزادهم نفورا
en: And when it is said to them: "Prostrate yourselves to the Most Gracious (Allah)! they say: "And what is the Most Gracious? Shall we fall down in prostration to that which you (O Muhammad صلى الله عليه وسلم) command us?" And it increases in them only aversion.

source: تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا
en: Blessed be He Who has placed in the heaven big stars, and has placed therein a great lamp (sun), and a moon giving light.

source: وهو الذي جعل الليل والنهار خلفة لمن أراد أن يذكر أو أراد شكورا
en: And He it is Who has put the night and the day in succession, for such who desires to remember or desires to show his gratitude.

source: وعباد الرحمن الذين يمشون على الأرض هونا وإذا خاطبهم الجاهلون قالوا سلاما
en: And the (faithful) slaves of the Most Gracious (Allah) are those who walk on the earth in humility and sedateness, and when the foolish address them (with bad words) they reply back with mild words of gentleness.

source: والذين يبيتون لربهم سجدا وقياما
en: And those who spend the night in worship of their Lord, prostrate and standing.

source: والذين يقولون ربنا اصرف عنا عذاب جهنم إن عذابها كان غراما
en: And those who say: "Our Lord! Avert from us the torment of Hell. Verily its torment is ever an inseparable, permanent punishment."

source: إنها ساءت مستقرا ومقاما
en: Evil indeed it (Hell) is as an abode and as a place to rest in.

source: والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما
en: And those who, when they spend, are neither extravagant nor niggardly, but hold a medium (way) between those (extremes).

source: والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما
en: And those who invoke not any other ilah (god) along with Allah, nor kill such person as Allah has forbidden, except for just cause, nor commit illegal sexual intercourse - and whoever does this shall receive the punishment.

source: يضاعف له العذاب يوم القيامة ويخلد فيه مهانا
en: The torment will be doubled to him on the Day of Resurrection, and he will abide therein in disgrace;

source: إلا من تاب وآمن وعمل عملا صالحا فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما
en: Except those who repent and believe (in Islamic Monotheism), and do righteous deeds; for those, Allah will change their sins into good deeds, and Allah is Oft-Forgiving, Most Merciful.

source: ومن تاب وعمل صالحا فإنه يتوب إلى الله متابا
en: And whosoever repents and does righteous good deeds; then verily, he repents towards Allah with true repentance.

source: والذين لا يشهدون الزور وإذا مروا باللغو مروا كراما
en: And those who do not bear witness to falsehood, and if they pass by some evil play or evil talk, they pass by it with dignity.

source: والذين إذا ذكروا بآيات ربهم لم يخروا عليها صما وعميانا
en: And those who, when they are reminded of the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, fall not deaf and blind thereat.

source: والذين يقولون ربنا هب لنا من أزواجنا وذرياتنا قرة أعين واجعلنا للمتقين إماما
en: And those who say: "Our Lord! Bestow on us from our wives and our offspring the comfort of our eyes, and make us leaders of the Muttaqun(the pious. See V.2:2)."

source: أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما
en: Those will be rewarded with the highest place (in Paradise) because of their patience. Therein they shall be met with greetings and the word of peace and respect.

source: خالدين فيها حسنت مستقرا ومقاما
en: Abiding therein - excellent it is as an abode, and as a place to rest in.

source: قل ما يعبأ بكم ربي لولا دعاؤكم فقد كذبتم فسوف يكون لزاما
en: Say (O Muhammad صلى الله عليه وسلم to the disbelievers): "My Lord pays attention to you only because of your invocation to Him. But now you have indeed denied (Him). So the torment will be yours for ever (inseparable, permanent punishment)."
